In [1]:
a = 8 
a

8

In [2]:

import pandas as pd
import numpy as np 
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(data)
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [3]:
# Pivot Tables :- It is a data summarization tool that is used in data processing.
# It allows you to reorganize and summarize selected columns and rows of data in a DataFrame
# create a pivot table data with coulmn 'date' 'region' 'sales' 'product', 'units' 'Rep', 'month', 'Quarter'
import pandas as pd
data = {
    'Date': pd.date_range(start='2023-01-01', periods=6, freq='M'),
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South'],
    'Sales': [100, 200, 150, 250, 300, 350],
    'Units': [10, 20, 15, 25, 30, 35],
    'Rep': ['John', 'Jane', 'John', 'Jane', 'John', 'Jane'],
    'Month': ['January', 'February', 'March', 'April', 'May', 'June'],
    'Quarter': ['Q1', 'Q1', 'Q1', 'Q2', 'Q2', 'Q2']
}
df = pd.DataFrame(data)
df
pivot_table = pd.pivot_table(df, values='Sales', index='Product', columns='Region', aggfunc='sum', fill_value=0)
pivot_table
# df.groupby('Name')  # Group by a column
# df.groupby('City')['Salary'].mean()  # Group by 'City' and calculate mean 'Salary'
# df
# pivot table operations and functions

C:\Users\HP\AppData\Local\Temp\ipykernel_19768\159710355.py:6: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  'Date': pd.date_range(start='2023-01-01', periods=6, freq='M'),

Region   North  South
Product
A          550      0
B            0    800